#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "Rus");
    cout << "В день субботний, начитавшись прозы,\n";
    cout << "Нагулявшись, наигравшись в гольф,\n";
    cout << "Во дворе забрался на березу\n";
    cout << "Симпатичный сорванец Адольф.\n\n";
    cout << "Желтизна уже листвы коснулась.\n";
    cout << "Моросил слегка осенний дождь.\n";
    cout << "Вдаль взирал Адольф. Береза гнулась.\n";
    cout << "Мимо проходил усатый вождь.\n\n";
    cout << "Гитлер стал отчаянно резвиться,\n";
    cout << "На ветвях вращаться кувырком.\n";
    cout << "Сталин посмотрел, остановился\n";
    cout << "И залюбовался смельчаком.\n\n";
    cout << "На скамейке бабушки кричали:\n";
    cout << "«Вон! Как обезьяна! Погляди!»\n";
    cout << "Говорил ему товарищ Сталин:\n";
    cout << "«Ай-ай-ай! Смотри не упади».\n\n";
    cout << "Но Адольф, смеясь и кувыркаясь,\n";
    cout << "Снова принимался за своё.\n";
    cout << "Ветерок, с березой обнимаясь,\n";
    cout << "Продолжал раскачивать её.\n";

    return 0;
}
